#### UIDocumentMacroOptions Enumeration

---

|  |
| --- |
| See Also |

The document macro options.

**Namespace:**   Autodesk.Revit.UI.Macros
  **Assembly:**   RevitAPIUIMacros  (in RevitAPIUIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum UIDocumentMacroOptions ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration UIDocumentMacroOptions ``` |

| Visual C++ |
| --- |
| ``` public enum class UIDocumentMacroOptions ``` |

# Members

| Member name | Description |
| --- | --- |
| Prompt | To prompt a dialog to ask the options during document opening. |
| DisableMacros | The option to disable macros in the document. |
| EnableMacros | The option to enable macros in the document. |

# See Also

Autodesk.Revit.UI.Macros Namespace